Repository: ilassAG/swiftHTMLWebviewApp
Catalog: swiftHTMLWebviewApp/*.lproj/Localizable.strings
Languages: fr, ja

# loading.url
source: Loading: %@
fr: Chargement : %@
ja: 読み込み中: %@

# error.cameraNotAvailable.title
source: Camera Not Available
fr: Caméra non disponible
ja: カメラ利用不可

# error.cameraNotAvailable.message
source: The camera is not available on this device.
fr: La caméra n'est pas disponible sur cet appareil.
ja: このデバイスではカメラを利用できません。

# error.barcodeScannerNotSupported.message
source: Barcode Scanner is not supported on this device.
fr: Le scanner de codes-barres n'est pas pris en charge sur cet appareil.
ja: バーコードスキャナーはこのデバイスでサポートされていません。

# error.invalidRequest.missingAction
source: Invalid request: Missing 'action' parameter.
fr: Requête invalide : Paramètre 'action' manquant.
ja: 無効なリクエスト: 'action' パラメータがありません。

# error.invalidRequest.unknownAction
source: Invalid request: Unknown action: %@
fr: Requête invalide : Action inconnue : %@
ja: 無効なリクエスト: 不明なアクション: %@

# error.documentScan.noImages
source: Document scan returned no images.
fr: La numérisation de documents n'a retourné aucune image.
ja: ドキュメントスキャンで画像が返されませんでした。

# error.ocr.failed
source: OCR failed: %@
fr: L'OCR a échoué : %@
ja: OCRに失敗しました: %@

# error.imageConversion.failed
source: Image conversion failed: %@
fr: La conversion de l'image a échoué : %@
ja: 画像変換に失敗しました: %@

# status.configurationChanged.reloading
source: Configuration changed via QR code. Reloading WebView.
fr: Configuration modifiée via le code QR. Rechargement du WebView.
ja: QRコード経由で設定が変更されました。WebViewをリロードしています。

# status.barcodeScan.success
source: Barcode scan successful: %@ (%@)
fr: Scan du code-barres réussi : %@ (%@)
ja: バーコードスキャン成功: %@ (%@)

# error.barcodeScan.failed
source: Barcode scan failed: %@
fr: Le scan du code-barres a échoué : %@
ja: バーコードスキャンに失敗しました: %@

# warning.sheetDismissed.requestActive
source: Sheet dismissed while request '%@' was potentially active. Sending cancellation error.
fr: Feuille fermée alors que la requête '%@' était potentiellement active. Envoi de l'erreur d'annulation.
ja: リクエスト '%@' がアクティブである可能性のある間にシートが閉じられました。キャンセルエラーを送信します。

# error.dataScanner.notAvailable
source: DataScanner is not available (likely missing camera permission).
fr: DataScanner n'est pas disponible (probablement autorisation de caméra manquante).
ja: DataScannerは利用できません（カメラの許可がない可能性があります）。

# error.dataScanner.startFailed
source: Scanner could not be started: %@
fr: Le scanner n'a pas pu démarrer : %@
ja: スキャナーを開始できませんでした: %@

# status.barcodeRecognized
source: Barcode recognized: %@ (Format: %@)
fr: Code-barres reconnu : %@ (Format : %@)
ja: バーコード認識: %@ (フォーマット: %@)

# status.securityToken.match
source: Security token match. Updating server URL to: %@
fr: Le jeton de sécurité correspond. Mise à jour de l'URL du serveur vers : %@
ja: セキュリティトークンが一致しました。サーバーURLを %@ に更新しています。

# error.securityToken.mismatch
source: Security token mismatch. Scanned: %@, Stored: %@
fr: Le jeton de sécurité ne correspond pas. Scanné : %@, Stocké : %@
ja: セキュリティトークンが一致しません。スキャンされたもの: %@, 保存されているもの: %@

# error.qr.jsonParseFailed
source: Failed to parse JSON from QR code: %@
fr: Impossible d'analyser le JSON du code QR : %@
ja: QRコードからJSONを解析できませんでした: %@

# warning.barcode.noStringValue
source: Recognized barcode has no string value.
fr: Le code-barres reconnu n'a pas de valeur chaîne.
ja: 認識されたバーコードに文字列値がありません。

# warning.dataScanner.unrecognizedItem
source: Unrecognized item type detected.
fr: Type d'élément non reconnu détecté.
ja: 認識されないアイテムタイプが検出されました。

# error.dataScanner.unavailable
source: DataScanner became unavailable: %@
fr: DataScanner est devenu indisponible : %@
ja: DataScannerが利用できなくなりました: %@

# error.documentScan.failed
source: Document scan failed: %@
fr: La numérisation du document a échoué : %@
ja: ドキュメントスキャンに失敗しました: %@

# error.ocr.cgImageFailed
source: Could not get CGImage for page %d.
fr: Impossible d'obtenir CGImage pour la page %d.
ja: ページ %d のCGImageを取得できませんでした。

# status.ocr.pageResult
source: OCR result for page %d: %@
fr: Résultat OCR pour la page %d : %@
ja: ページ %d のOCR結果: %@

# ocr.pageSeparator
source: --- Page %d ---
ja: --- ページ %d ---

# barcode.type.qr
source: QR Code
fr: Code QR
ja: QRコード

# barcode.type.code128
source: Code 128
ja: コード128

# barcode.type.code39
source: Code 39
ja: コード39

# barcode.type.code93
source: Code 93
ja: コード93

# barcode.type.aztec
source: Aztec
fr: Aztèque
ja: アステカ

# barcode.type.datamatrix
source: Data Matrix
ja: データマトリックス

# barcode.type.unknown
source: Unknown Barcode Format
fr: Format de code-barres inconnu
ja: 不明なバーコード形式

# error.appError.userCancelled
source: Action cancelled by user.
fr: Action annulée par l'utilisateur.
ja: ユーザーによってアクションがキャンセルされました。

# error.appError.featureNotAvailable
source: %@ is not available on this device or under current conditions.
fr: %@ n'est pas disponible sur cet appareil ou dans les conditions actuelles.
ja: %@ はこのデバイスまたは現在の条件下では利用できません。

# error.appError.cameraPermissionDenied
source: Access to the camera was denied. Please allow in Settings.
fr: L'accès à la caméra a été refusé. Veuillez l'autoriser dans les Réglages.
ja: カメラへのアクセスが拒否されました。設定で許可してください。

# error.appError.internalError
source: An internal error occurred: %@
fr: Une erreur interne s'est produite : %@
ja: 内部エラーが発生しました: %@

# error.appError.pdfCreationFailed
source: PDF document could not be created.
fr: Le document PDF n'a pas pu être créé.
ja: PDFドキュメントを作成できませんでした。

# error.appError.ocrFailed.base
source: Text recognition (OCR) failed.
fr: La reconnaissance de texte (OCR) a échoué.
ja: テキスト認識（OCR）に失敗しました。

# error.appError.ocrFailed.withError
source: Text recognition (OCR) failed. Error: %@
fr: La reconnaissance de texte (OCR) a échoué. Erreur : %@
ja: テキスト認識（OCR）に失敗しました。エラー: %@

# error.appError.imageConversionFailed
source: Image could not be converted: %@
fr: L'image n'a pas pu être convertie : %@
ja: 画像を変換できませんでした: %@

# error.appError.invalidRequest
source: Invalid request from JavaScript: %@
fr: Requête invalide depuis JavaScript : %@
ja: JavaScriptからの無効なリクエスト: %@

# error.appError.webViewCommunicationError
source: Error communicating with WebView: %@
fr: Erreur de communication avec WebView : %@
ja: WebViewとの通信エラー: %@

# error.appError.invalidConfiguration
source: Configuration error: %@
fr: Erreur de configuration : %@
ja: 設定エラー: %@

# pdf.creator
source: swiftHTMLWebviewDemo App
fr: App swiftHTMLWebviewDemo
ja: swiftHTMLWebviewDemoアプリ

# pdf.author
source: User via App
fr: Utilisateur via App
ja: ユーザー (アプリ経由)

# error.url.invalid
source: Invalid URL string: %@
fr: Chaîne d'URL invalide : %@
ja: 無効なURL文字列: %@

# error.url.switchToDefault.reason
source: Switching to default URL. Reason: %@
fr: Passage à l'URL par défaut. Raison : %@
ja: デフォルトURLに切り替えています。理由: %@

# error.url.maxLoadAttemptsReached
source: Maximum load attempts (%d) reached for %@. Switching to default URL.
fr: Nombre maximal de tentatives de chargement (%d) atteint pour %@. Passage à l'URL par défaut.
ja: %@ の最大読み込み試行回数 (%d回) に達しました。デフォルトURLに切り替えています。

# status.url.loadingAttempt
source: Attempting to load URL: %@ (Attempt: %d)
fr: Tentative de chargement de l'URL : %@ (Tentative : %d)
ja: URLの読み込み試行中: %@ (試行回数: %d)

# error.url.defaultInvalid
source: CRITICAL Error: Default URL is also invalid: %@
fr: Erreur CRITIQUE : L'URL par défaut est également invalide : %@
ja: 致命的なエラー: デフォルトURLも無効です: %@

# error.webView.jsParseError
source: Could not parse message body from JavaScript. Body: %@
fr: Impossible d'analyser le corps du message depuis JavaScript. Corps : %@
ja: JavaScriptからのメッセージ本文を解析できませんでした。本文: %@

# error.webView.jsParseError.generic
source: Message from JS could not be read.
fr: Le message de JS n'a pas pu être lu.
ja: JSからのメッセージを読み取れませんでした。

# error.webView.localHTMLNotFound
source: Error: Could not find %@.html in HTML subdirectory.
fr: Erreur : Impossible de trouver %@.html dans le sous-répertoire HTML.
ja: エラー: HTMLサブディレクトリに %@.html が見つかりませんでした。

# status.webView.loadingLocalHTML
source: Fallback: Loading local HTML from: %@
fr: Fallback : Chargement du HTML local depuis : %@
ja: フォールバック: ローカルHTMLを読み込み中: %@

# status.webView.loadingRemoteHTML
source: Loading remote HTML from: %@
fr: Chargement du HTML distant depuis : %@
ja: リモートHTMLを読み込み中: %@

# error.featureNotAvailable.camera
source: Camera
fr: Caméra
ja: カメラ

# error.featureNotAvailable.barcodeScanner
source: Barcode Scanner
fr: Scanner de codes-barres
ja: バーコードスキャナー

# error.internalError.imageNotReceived
source: Image could not be received from camera.
fr: L'image n'a pas pu être reçue de la caméra.
ja: カメラから画像を受信できませんでした。

# error.internalError.noImagesFromScanner
source: No images received from scanner.
fr: Aucune image reçue du scanner.
ja: スキャナーから画像を受信できませんでした。

# error.imageConversionFailed.noImagesConverted
source: No images could be converted.
fr: Aucune image n'a pu être convertie.
ja: 画像を変換できませんでした。

# error.imageConversionFailed.specificType
source: Image could not be converted to %@.
fr: L'image n'a pas pu être convertie en %@.
ja: 画像を %@ に変換できませんでした。

# error.invalidConfiguration.invalidToken
source: Invalid security token.
fr: Jeton de sécurité invalide.
ja: 無効なセキュリティトークン。

# error.internalError.scannerNotSupported
source: Scanner is not supported on this device: %@
fr: Le scanner n'est pas pris en charge sur cet appareil : %@
ja: スキャナーはこのデバイスでサポートされていません: %@

# error.internalError.unknownScannerError
source: Unknown scanner error: %@
fr: Erreur de scanner inconnue : %@
ja: 不明なスキャナーエラー: %@

# error.internalError.documentScanFailed
source: Document scan failed: %@
fr: La numérisation du document a échoué : %@
ja: ドキュメントスキャンに失敗しました: %@

# error.internalError.cgImageCreationFailed
source: CGImage for page %d could not be created.
fr: CGImage pour la page %d n'a pas pu être créé.
ja: ページ %d のCGImageを作成できませんでした。

# error.internalError.jsonResponseFailed
source: Failed to create JSON response.
fr: La réponse JSON n'a pas pu être créée.
ja: JSONレスポンスを作成できませんでした。

# error.internalError.criticalFailure
source: Internal Swift Error: Critical failure.
fr: Erreur Swift interne : Échec critique.
ja: 内部Swiftエラー: 致命的な障害。
